# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model. More improvement points for RT-DETR, please see https://github.com/iscyy/ultralyticsPro

# Parameters
nc: 80  # number of classes
scales: 
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# loss: SIoU

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, CSCFocalNeXt, [64]]   # stage 2
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, CSCFocalNeXt, [128]]   # stage 2
  - [-1, 1, DWConv, [256, 3, 2, 1, False]]  # 4-P3/16
  - [-1, 6, CSCFocalNeXt, [256]]  # stage 3
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 3, CSCFocalNeXt, [512]]  # stage 3
  - [-1, 3, SKAttention, [512]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]   # 12, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 14 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]  # 16, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 17, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 19 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, RepC3, [256]]    # X3 (21), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 22, downsample_convs.0
  - [[-1, 16], 1, Concat, [1]]  # cat Y4
  - [-1, 3, RepC3, [256]]    # F4 (24), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 25, downsample_convs.1
  - [[-1, 11], 1, Concat, [1]]  # cat Y5
  - [-1, 3, RepC3, [256]]    # F5 (27), pan_blocks.1

  - [[20, 23, 26], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)
