# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, C3_Biformer, [128, 8]]   # stage 2
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, C3_Biformer, [128, 4]]   # stage 2
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]
  - [-1, 6, ReNLANBiF, [512, 256, 128, 2]]  # stage 3
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 6, HGBlock, [512, 1024, 5, True, False]]  # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, SimConv, [256, 1, 1]]
  - [[3, 5, -1], 1, BiFusion, [256]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 12, RepBlock, [256]]

  - [-1, 1, SimConv, [128, 1, 1]]
  - [[1, 3, -1], 1, BiFusion, [128]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 12, RepBlock, [256]]  # 20

  - [-1, 1, SimConv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 12, RepBlock, [256]]  # 23

  - [-1, 1, SimConv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 12, RepBlock, [256]]  # 26

  - [[18, 21, 24], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)l