# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # stage 1
  - [-1, 1, DWConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]  # stage 2
  - [-1, 1, DWConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, HGBlock, [384, 1024, 5, True, False]]  # stage 4
  - [-1, 1, DWConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 6, HGBlock, [384, 1024, 5, True, False]]  # stage 4
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 12, Y5, lateral_convs.0
  
  - [-1, 1, SimConv, [256, 1, 1]]
  - [[4, 6, -1], 1, BiFusion, [256]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 12, RepBlock, [256]]

  - [-1, 1, SimConv, [128, 1, 1]]
  - [[2, 4, -1], 1, BiFusion, [128]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 12, RepBlock, [256]]  

  - [-1, 1, SimConv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]  
  - [-1, 12, RepBlock, [256]]  

  - [-1, 1, SimConv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  
  - [-1, 12, RepBlock, [256]]#26

  - [[20, 23, 26], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)
