# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model. More improvement points for RT-DETR, please see https://github.com/iscyy/ultralyticsPro

# Parameters
nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# loss: SIoU

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, C3_Biformer, [128, 8]]   # stage 2
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, C3_Biformer, [128, 4]]   # stage 2
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]
  - [-1, 6, ReNLANBiF, [512, 256, 128, 2]]  # stage 3
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 6, HGBlock, [512, 1024, 5, True, False]]  # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, SimConv, [256, 1, 1]]
  - [[4, 6, -1], 1, BiFusion, [256]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 12, RepBlock, [256]]

  - [-1, 1, SimConv, [128, 1, 1]]
  - [[2, 4, -1], 1, BiFusion, [128]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 12, RepBlock, [256]]  # 20

  - [-1, 1, SimConv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 12, RepBlock, [256]]  # 23

  - [-1, 1, SimConv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 12, RepBlock, [256]]  # 26

  - [-1, 3, ReparamLKB, [256, 1, 1]]
  - [-5, 3, ReparamLKB, [256, 1, 1]]
  - [-9, 3, ReparamLKB, [256, 1, 1]]

  - [[27, 28, 29], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5)